alert('reduce');

// 1. Дан массив с числами. Найдите сумму этих чисел.



// 2. Дан массив с числами. Найдите сумму первых N элементов до первого нуля. 
// Пример: [1, 2, 3, 0, 4, 5, 6] - суммируем первые 3 элемента, так как дальше стоит элемент с числом 0.




// 3. Дан массив с числами. Найдите сумму последних N элементов до первого нуля с конца. 
// Пример: [1, 2, 3, 0, 4, 5, 6] - суммируем последние 3 элемента, так как дальше стоит элемент с числом 0.





// 4. Дан массив с числами. Узнайте сколько элементов с начала массива надо сложить, чтобы в сумме получилось больше 10-ти.





// 5. Дан массив с числами. Узнайте сколько элементов с конца массива надо сложить, чтобы в сумме получилось больше 10-ти.